Configuration_project_01/src/InformationRegisters/АЭС_ОтветственныеЛицаОрганизации/АЭС_ОтветственныеЛицаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АЭС_ОтветственныеЛицаОрганизации</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>EnumRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration_project_01/src/InformationRegisters/АЭС_ОтветственныеЛицаОрганизации/ManagerModule.bsl
Функция ПолучитьОтветственногоИДолжность(Подразделение, ДатаОкончания, Руководитель)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АЭС_ОтветственныеЛицаОрганизацииСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	АЭС_ОтветственныеЛицаОрганизацииСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.АЭС_ОтветственныеЛицаОрганизации.СрезПоследних(
		|			&Дата,
		|			Подразделение В (&Подразделение)
		|				И ОтветственноеЛицо = &Ответственный) КАК АЭС_ОтветственныеЛицаОрганизацииСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ДатаОкончания);
	Запрос.УстановитьПараметр("Ответственный", Руководитель);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ОтветственнойЛицо = Новый Структура;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОтветственнойЛицо.Вставить("ФИО", ВыборкаДетальныеЗаписи.ФизЛицо);
		ОтветственнойЛицо.Вставить("Должность", ВыборкаДетальныеЗаписи.Должность);
	КонецЦикла;
	Возврат ОтветственнойЛицо; 	

КонецФункции
